#####IMPORT-
import telebot 	#Подключаем API
import config 	#Подключаем конфигуратор
#####SETUP-
bot = telebot.TeleBot(config.token) # Token
#####SCHEDULE-
def schedule(team,day,id):
	error0 ='ERROR_0: День недели не найден!'
	error1 ='ERROR_0: Класс не найден!'
	if team =='8Б':
		if   day ==1:
			bot.send_message(id,'''
			<b>П-О-Н-Е-Д-Е-Л-Ь-Н-И-К
			1 |00:00  -  00:00| О важном
			2 |00:00  -  00:00| География
			3 |00:00  -  00:00| Русский язык
			4 |00:00  -  00:00| Английский язык
			5 |00:00  -  00:00| Алгебра
			6 |00:00  -  00:00| История
			7 |00:00  -  00:00| Черчение
			8 |00:00  -  00:00| -
			есть ошибка? напиши /bug_report
			</b>''',parse_mode='html')
		elif day ==2:
			bot.send_message(id,'''
			<b>В-Т-О-Р-Н-И-К
			1 |00:00  -  00:00| Литература
			2 |00:00  -  00:00| Биология
			3 |00:00  -  00:00|	Химия
			4 |00:00  -  00:00| Физика
			5 |00:00  -  00:00| Алгебра
			6 |00:00  -  00:00| Физкультура
			7 |00:00  -  00:00| Геометрия
			8 |00:00  -  00:00| -
			есть ошибка? напиши /bug_report
			</b>''',parse_mode='html')
		elif day ==3:
			bot.send_message(id,'''
			<b>С-Р-Е-Д-А
			1 |00:00  -  00:00| Алгебра
			2 |00:00  -  00:00| Информатика
			3 |00:00  -  00:00|	Геометрия
			4 |00:00  -  00:00| Русский язык
			5 |00:00  -  00:00| Английский язык
			6 |00:00  -  00:00| География
			7 |00:00  -  00:00| -
			8 |00:00  -  00:00| -
			есть ошибка? напиши /bug_report
			</b>''',parse_mode='html')
		elif day ==4:
			bot.send_message(id,'''
			<b>Ч-Е-Т-В-Е-Р-Г
			1 |00:00  -  00:00| Музыка
			2 |00:00  -  00:00| Биология
			3 |00:00  -  00:00|	Литература
			4 |00:00  -  00:00| Физика
			5 |00:00  -  00:00| Геометрия
			6 |00:00  -  00:00| Обществознание
			7 |00:00  -  00:00| Физкультура
			8 |00:00  -  00:00| -
			есть ошибка? напиши /bug_report
			</b>''',parse_mode='html')
		elif day ==5:
			bot.send_message(id,'''
			<b>П-Я-Т-Н-И-Ц-А
			1 |00:00  -  00:00| История
			2 |00:00  -  00:00| Химия
			3 |00:00  -  00:00|	Русский язык
			4 |00:00  -  00:00| Физкультура
			5 |00:00  -  00:00| ИЗО
			6 |00:00  -  00:00| ОБЖ
			7 |00:00  -  00:00| Английский язык
			8 |00:00  -  00:00| -
			есть ошибка? напиши /bug_report
			</b>''',parse_mode='html')
		else:
			bot.send_message(id,error0)
			print(error0) 
	else:
		print(error1)