#####IMPORT-
import config
import logger
#####CODE-
def schedule(day):
	if   day ==1 or day=='1':
		return('''
		<b>ПОНЕДЕЛЬНИК
		1 |00:00  -  00:00| О важном
		2 |00:00  -  00:00| География
		3 |00:00  -  00:00| Русский язык
		4 |00:00  -  00:00| Английский язык
		5 |00:00  -  00:00| Алгебра
		6 |00:00  -  00:00| История
		7 |00:00  -  00:00| Черчение
		8 |00:00  -  00:00| -
		есть ошибка? напиши /bug_report
		</b>''')
	elif day ==2 or day=='2':
		return('''
		<b>ВТОРНИК
		1 |00:00  -  00:00| Литература
		2 |00:00  -  00:00| Биология
		3 |00:00  -  00:00|	Химия
		4 |00:00  -  00:00| Физика
		5 |00:00  -  00:00| Алгебра
		6 |00:00  -  00:00| Физкультура
		7 |00:00  -  00:00| Геометрия
		8 |00:00  -  00:00| -
		есть ошибка? напиши /bug_report
		</b>''')
	elif day ==3 or day=='3':
		return('''
		<b>СРЕДА
		1 |00:00  -  00:00| Алгебра
		2 |00:00  -  00:00| Информатика
		3 |00:00  -  00:00|	Геометрия
		4 |00:00  -  00:00| Русский язык
		5 |00:00  -  00:00| Английский язык
		6 |00:00  -  00:00| География
		7 |00:00  -  00:00| -
		8 |00:00  -  00:00| -
		есть ошибка? напиши /bug_report
		</b>''')
	elif day ==4 or day=='4':
		return('''
		<b>ЧЕТВЕРГ
		1 |00:00  -  00:00| Музыка
		2 |00:00  -  00:00| Биология
		3 |00:00  -  00:00|	Литература
		4 |00:00  -  00:00| Физика
		5 |00:00  -  00:00| Геометрия
		6 |00:00  -  00:00| Обществознание
		7 |00:00  -  00:00| Физкультура
		8 |00:00  -  00:00| -
		есть ошибка? напиши /bug_report
		</b>''')
	elif day ==5 or day=='5':
		return('''
		<b>ПЯТНИЦА
		1 |00:00  -  00:00| История
		2 |00:00  -  00:00| Химия
		3 |00:00  -  00:00|	Русский язык
		4 |00:00  -  00:00| Физкультура
		5 |00:00  -  00:00| ИЗО
		6 |00:00  -  00:00| ОБЖ
		7 |00:00  -  00:00| Английский язык
		8 |00:00  -  00:00| -
		есть ошибка? напиши /bug_report
		</b>''')
	else:
		logger.log('WS','datacenter/scheldule','404: '+str(day)+' NOT FOUND!')
		bot.send_message(id,f'/datacenter/schedule/'+str(day)+' NOT FOUND!')
