#ПОНЕДЕЛЬНИК
monday='''
<b>П-О-Н-Е-Д-Е-Л-Ь-Н-И-К
1 |08:45  -  09:30| Физкультура  [ЗАЛ]
2 |09:40  -  10:25| Информатика  [235]
3 |10:45  -  11:30| Русский язык [202]
4 |11:50  -  12:35| Литература 	 [202]
5 |12:55  -  13:40| Биология     [214]
6 |13:50  -  14:35| Английский   [208]
7 |14:45  -  15:30| –
есть ошибка? напиши /bug_report
</b>
'''									#END
#ВТОРНИК
tuesday=''' 
<b>В-Т-О-Р-Н-И-К
1 |08:45  -  09:30| Физкультура  [ЗАЛ]
2 |09:40  -  10:25| Информатика  [235]
3 |10:45  -  11:30| Русский язык [202]
4 |11:50  -  12:35| Литература 	 [202]
5 |12:55  -  13:40| Биология     [214]
6 |13:50  -  14:35| Английский   [208]
7 |14:45  -  15:30| –
есть ошибка? напиши /bug_report
</b>
'''									#END
#СРЕДА
wednesday='''
<b>С-Р-Е-Д-А
1 |8:45   -   9:30| Физкультура  [ЗАЛ]
2 |9:40   -  10:25| Информатика  [235]
3 |10:45  -  11:30| Русский язык [202]
4 |11:50  -  12:35| Литература 	 [202]
5 |12:55  -  13:40| Биология     [214]
6 |13:50  -  14:35| Английский   [208]
7 |14:45  -  15:30| –
есть ошибка? напиши /bug_report</b>
'''									#END
#ЧЕТВЕРГ
thursday='''
<b>Ч-Е-Т-В-Е-Р-Г
1 |8:45   -   9:30| Физкультура  [ЗАЛ]
2 |9:40   -  10:25| Информатика  [235]
3 |10:45  -  11:30| Русский язык [202]
4 |11:50  -  12:35| Литература 	 [202]
5 |12:55  -  13:40| Биология     [214]
6 |13:50  -  14:35| Английский   [208]
7 |14:45  -  15:30| –
есть ошибка? напиши /bug_report</b>
'''									#END
#ПЯТНИЦА
friday='''
<b>П-Я-Т-Н-И-Ц-А
1 |8:45   -   9:30| Физкультура  [ЗАЛ]
2 |9:40   -  10:25| Информатика  [235]
3 |10:45  -  11:30| Русский язык [202]
4 |11:50  -  12:35| Литература 	 [202]
5 |12:55  -  13:40| Биология     [214]
6 |13:50  -  14:35| Английский   [208]
7 |14:45  -  15:30| –
есть ошибка? напиши /bug_report</b>
'''									#END